TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/driverlib/inc/hw_dcsm.h
#define DCSM_O_FLSEM        0x0U    // Flash Wrapper Semaphore Register
#define DCSM_O_SECTSTAT1    0x8U    // Flash Sectors Status Register 1
#define DCSM_O_SECTSTAT2    0xAU    // Flash Sectors Status Register 2
#define DCSM_O_SECTSTAT3    0xCU    // Flash Sectors Status Register 3
#define DCSM_O_RAMSTAT1     0x10U   // RAM Status Register 1
#define DCSM_O_SECERRSTAT   0x18U   // Security Error Status Register
#define DCSM_O_SECERRCLR    0x1AU   // Security Error Clear Register
#define DCSM_O_SECERRFRC    0x1CU   // Security Error Force Register




//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_LINKPOINTER register
//
//*************************************************************************************************
#define DCSM_Z1_LINKPOINTER_LINKPOINTER_S   0U
#define DCSM_Z1_LINKPOINTER_LINKPOINTER_M   0x3FFFU   // Zone1 LINK Pointer

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_OTPSECLOCK register
//
//*************************************************************************************************
#define DCSM_Z1_OTPSECLOCK_JTAGLOCK     0x1U     // JTAG Lock Status
#define DCSM_Z1_OTPSECLOCK_PSWDLOCK_S   4U
#define DCSM_Z1_OTPSECLOCK_PSWDLOCK_M   0xF0U    // Zone1 Password Lock.
#define DCSM_Z1_OTPSECLOCK_CRCLOCK_S    8U
#define DCSM_Z1_OTPSECLOCK_CRCLOCK_M    0xF00U   // Zone1 CRC Lock.

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_JLM_ENABLE register
//
//*************************************************************************************************
#define DCSM_Z1_JLM_ENABLE_Z1_JLM_ENABLE_S   0U
#define DCSM_Z1_JLM_ENABLE_Z1_JLM_ENABLE_M   0xFU   // Zone1 JLM_ENABLE register.

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_LINKPOINTERERR register
//
//*************************************************************************************************
#define DCSM_Z1_LINKPOINTERERR_Z1_LINKPOINTERERR_S   0U
#define DCSM_Z1_LINKPOINTERERR_Z1_LINKPOINTERERR_M   0x3FFFU   // Error to Resolve Z1 Link pointer
                                                               // from OTP loaded values

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_CR register
//
//*************************************************************************************************
#define DCSM_Z1_CR_ALLZERO    0x80000U      // CSMPSWD All Zeros
#define DCSM_Z1_CR_ALLONE     0x100000U     // CSMPSWD All Ones
#define DCSM_Z1_CR_UNSECURE   0x200000U     // CSMPSWD Match CSMKEY
#define DCSM_Z1_CR_ARMED      0x400000U     // CSM Passwords Read Status
#define DCSM_Z1_CR_FORCESEC   0x80000000U   // Force Secure

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_GRABSECT1R register
//
//*************************************************************************************************
#define DCSM_Z1_GRABSECT1R_GRAB_SECT0_S    0U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT0_M    0x3U          // Grab Flash Sector 0 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT1_S    2U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT1_M    0xCU          // Grab Flash Sector 1 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT2_S    4U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT2_M    0x30U         // Grab Flash Sector 2 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT3_S    6U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT3_M    0xC0U         // Grab Flash Sector 3 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT4_S    8U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT4_M    0x300U        // Grab Flash Sector 4 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT5_S    10U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT5_M    0xC00U        // Grab Flash Sector 5 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT6_S    12U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT6_M    0x3000U       // Grab Flash Sector 6 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT7_S    14U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT7_M    0xC000U       // Grab Flash Sector 7 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT8_S    16U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT8_M    0x30000U      // Grab Flash Sector 8 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT9_S    18U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT9_M    0xC0000U      // Grab Flash Sector 9 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT10_S   20U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT10_M   0x300000U     // Grab Flash Sector 10 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT11_S   22U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT11_M   0xC00000U     // Grab Flash Sector 11 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT12_S   24U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT12_M   0x3000000U    // Grab Flash Sector 12 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT13_S   26U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT13_M   0xC000000U    // Grab Flash Sector 13 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT14_S   28U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT14_M   0x30000000U   // Grab Flash Sector 14 in Bank 0
#define DCSM_Z1_GRABSECT1R_GRAB_SECT15_S   30U
#define DCSM_Z1_GRABSECT1R_GRAB_SECT15_M   0xC0000000U   // Grab Flash Sector 15 in Bank 0

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_GRABSECT2R register
//
//*************************************************************************************************
#define DCSM_Z1_GRABSECT2R_GRAB_SECT0_S    0U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT0_M    0x3U          // Grab Flash Sector 0 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT1_S    2U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT1_M    0xCU          // Grab Flash Sector 1 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT2_S    4U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT2_M    0x30U         // Grab Flash Sector 2 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT3_S    6U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT3_M    0xC0U         // Grab Flash Sector 3 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT4_S    8U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT4_M    0x300U        // Grab Flash Sector 4 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT5_S    10U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT5_M    0xC00U        // Grab Flash Sector 5 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT6_S    12U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT6_M    0x3000U       // Grab Flash Sector 6 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT7_S    14U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT7_M    0xC000U       // Grab Flash Sector 7 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT8_S    16U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT8_M    0x30000U      // Grab Flash Sector 8 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT9_S    18U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT9_M    0xC0000U      // Grab Flash Sector 9 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT10_S   20U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT10_M   0x300000U     // Grab Flash Sector 10 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT11_S   22U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT11_M   0xC00000U     // Grab Flash Sector 11 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT12_S   24U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT12_M   0x3000000U    // Grab Flash Sector 12 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT13_S   26U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT13_M   0xC000000U    // Grab Flash Sector 13 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT14_S   28U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT14_M   0x30000000U   // Grab Flash Sector 14 in Bank 1
#define DCSM_Z1_GRABSECT2R_GRAB_SECT15_S   30U
#define DCSM_Z1_GRABSECT2R_GRAB_SECT15_M   0xC0000000U   // Grab Flash Sector 15 in Bank 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_GRABSECT3R register
//
//*************************************************************************************************
#define DCSM_Z1_GRABSECT3R_GRAB_SECT0_S    0U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT0_M    0x3U          // Grab Flash Sector 0 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT1_S    2U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT1_M    0xCU          // Grab Flash Sector 1 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT2_S    4U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT2_M    0x30U         // Grab Flash Sector 2 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT3_S    6U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT3_M    0xC0U         // Grab Flash Sector 3 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT4_S    8U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT4_M    0x300U        // Grab Flash Sector 4 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT5_S    10U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT5_M    0xC00U        // Grab Flash Sector 5 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT6_S    12U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT6_M    0x3000U       // Grab Flash Sector 6 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT7_S    14U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT7_M    0xC000U       // Grab Flash Sector 7 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT8_S    16U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT8_M    0x30000U      // Grab Flash Sector 8 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT9_S    18U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT9_M    0xC0000U      // Grab Flash Sector 9 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT10_S   20U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT10_M   0x300000U     // Grab Flash Sector 10 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT11_S   22U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT11_M   0xC00000U     // Grab Flash Sector 11 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT12_S   24U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT12_M   0x3000000U    // Grab Flash Sector 12 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT13_S   26U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT13_M   0xC000000U    // Grab Flash Sector 13 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT14_S   28U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT14_M   0x30000000U   // Grab Flash Sector 14 in Bank 2
#define DCSM_Z1_GRABSECT3R_GRAB_SECT15_S   30U
#define DCSM_Z1_GRABSECT3R_GRAB_SECT15_M   0xC0000000U   // Grab Flash Sector 15 in Bank 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_GRABRAM1R register
//
//*************************************************************************************************
#define DCSM_Z1_GRABRAM1R_GRAB_RAM0_S   0U
#define DCSM_Z1_GRABRAM1R_GRAB_RAM0_M   0x3U      // Grab RAM LS0
#define DCSM_Z1_GRABRAM1R_GRAB_RAM1_S   2U
#define DCSM_Z1_GRABRAM1R_GRAB_RAM1_M   0xCU      // Grab RAM LS1
#define DCSM_Z1_GRABRAM1R_GRAB_RAM2_S   4U
#define DCSM_Z1_GRABRAM1R_GRAB_RAM2_M   0x30U     // Grab RAM LS2
#define DCSM_Z1_GRABRAM1R_GRAB_RAM3_S   6U
#define DCSM_Z1_GRABRAM1R_GRAB_RAM3_M   0xC0U     // Grab RAM LS3
#define DCSM_Z1_GRABRAM1R_GRAB_RAM4_S   8U
#define DCSM_Z1_GRABRAM1R_GRAB_RAM4_M   0x300U    // Grab RAM LS4
#define DCSM_Z1_GRABRAM1R_GRAB_RAM5_S   10U
#define DCSM_Z1_GRABRAM1R_GRAB_RAM5_M   0xC00U    // Grab RAM LS5
#define DCSM_Z1_GRABRAM1R_GRAB_RAM6_S   12U
#define DCSM_Z1_GRABRAM1R_GRAB_RAM6_M   0x3000U   // Grab RAM LS6
#define DCSM_Z1_GRABRAM1R_GRAB_RAM7_S   14U
#define DCSM_Z1_GRABRAM1R_GRAB_RAM7_M   0xC000U   // Grab RAM LS7

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_EXEONLYSECT1R register
//
//*************************************************************************************************
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT0    0x1U          // Execute-Only Flash Sector 0
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT1    0x2U          // Execute-Only Flash Sector 1
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT2    0x4U          // Execute-Only Flash Sector 2
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT3    0x8U          // Execute-Only Flash Sector 3
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT4    0x10U         // Execute-Only Flash Sector 4
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT5    0x20U         // Execute-Only Flash Sector 5
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT6    0x40U         // Execute-Only Flash Sector 6
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT7    0x80U         // Execute-Only Flash Sector 7
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT8    0x100U        // Execute-Only Flash Sector 8
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT9    0x200U        // Execute-Only Flash Sector 9
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT10   0x400U        // Execute-Only Flash Sector 10
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT11   0x800U        // Execute-Only Flash Sector 11
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT12   0x1000U       // Execute-Only Flash Sector 12
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT13   0x2000U       // Execute-Only Flash Sector 13
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT14   0x4000U       // Execute-Only Flash Sector 14
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK0_SECT15   0x8000U       // Execute-Only Flash Sector 15
                                                                   // in flash Bank 0
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT0    0x10000U      // Execute-Only Flash Sector 0
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT1    0x20000U      // Execute-Only Flash Sector 1
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT2    0x40000U      // Execute-Only Flash Sector 2
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT3    0x80000U      // Execute-Only Flash Sector 3
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT4    0x100000U     // Execute-Only Flash Sector 4
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT5    0x200000U     // Execute-Only Flash Sector 5
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT6    0x400000U     // Execute-Only Flash Sector 6
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT7    0x800000U     // Execute-Only Flash Sector 7
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT8    0x1000000U    // Execute-Only Flash Sector 8
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT9    0x2000000U    // Execute-Only Flash Sector 9
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT10   0x4000000U    // Execute-Only Flash Sector 10
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT11   0x8000000U    // Execute-Only Flash Sector 11
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT12   0x10000000U   // Execute-Only Flash Sector 12
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT13   0x20000000U   // Execute-Only Flash Sector 13
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT14   0x40000000U   // Execute-Only Flash Sector 14
                                                                   // in flash Bank 1
#define DCSM_Z1_EXEONLYSECT1R_EXEONLY_BANK1_SECT15   0x80000000U   // Execute-Only Flash Sector 15
                                                                   // in flash Bank 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_EXEONLYSECT2R register
//
//*************************************************************************************************
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT0    0x1U      // Execute-Only Flash Sector 0 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT1    0x2U      // Execute-Only Flash Sector 1 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT2    0x4U      // Execute-Only Flash Sector 2 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT3    0x8U      // Execute-Only Flash Sector 3 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT4    0x10U     // Execute-Only Flash Sector 4 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT5    0x20U     // Execute-Only Flash Sector 5 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT6    0x40U     // Execute-Only Flash Sector 6 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT7    0x80U     // Execute-Only Flash Sector 7 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT8    0x100U    // Execute-Only Flash Sector 8 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT9    0x200U    // Execute-Only Flash Sector 9 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT10   0x400U    // Execute-Only Flash Sector 10 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT11   0x800U    // Execute-Only Flash Sector 11 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT12   0x1000U   // Execute-Only Flash Sector 12 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT13   0x2000U   // Execute-Only Flash Sector 13 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT14   0x4000U   // Execute-Only Flash Sector 14 in
                                                               // flash BANK 2
#define DCSM_Z1_EXEONLYSECT2R_EXEONLY_BANK2_SECT15   0x8000U   // Execute-Only Flash Sector 15 in
                                                               // flash BANK 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z1_EXEONLYRAM1R register
//
//*************************************************************************************************
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM0   0x1U    // Execute-Only RAM LS0
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM1   0x2U    // Execute-Only RAM LS1
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM2   0x4U    // Execute-Only RAM LS2
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM3   0x8U    // Execute-Only RAM LS3
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM4   0x10U   // Execute-Only RAM LS4
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM5   0x20U   // Execute-Only RAM LS5
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM6   0x40U   // Execute-Only RAM LS6
#define DCSM_Z1_EXEONLYRAM1R_EXEONLY_RAM7   0x80U   // Execute-Only RAM LS7


//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_LINKPOINTER register
//
//*************************************************************************************************
#define DCSM_Z2_LINKPOINTER_LINKPOINTER_S   0U
#define DCSM_Z2_LINKPOINTER_LINKPOINTER_M   0x3FFFU   // Zone2 LINK Pointer

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_OTPSECLOCK register
//
//*************************************************************************************************
#define DCSM_Z2_OTPSECLOCK_JTAGLOCK     0x1U     // JTAG Lock Status
#define DCSM_Z2_OTPSECLOCK_PSWDLOCK_S   4U
#define DCSM_Z2_OTPSECLOCK_PSWDLOCK_M   0xF0U    // Zone2 Password Lock.
#define DCSM_Z2_OTPSECLOCK_CRCLOCK_S    8U
#define DCSM_Z2_OTPSECLOCK_CRCLOCK_M    0xF00U   // Zone2 CRC Lock.

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_LINKPOINTERERR register
//
//*************************************************************************************************
#define DCSM_Z2_LINKPOINTERERR_Z2_LINKPOINTERERR_S   0U
#define DCSM_Z2_LINKPOINTERERR_Z2_LINKPOINTERERR_M   0x3FFFU   // Error to Resolve Z2 Link pointer
                                                               // from OTP loaded values

