TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/driverlib/inc/hw_dcsm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_CR register
//
//*************************************************************************************************
#define DCSM_Z2_CR_ALLZERO    0x80000U      // CSMPSWD All Zeros
#define DCSM_Z2_CR_ALLONE     0x100000U     // CSMPSWD All Ones
#define DCSM_Z2_CR_UNSECURE   0x200000U     // CSMPSWD Match CSMKEY
#define DCSM_Z2_CR_ARMED      0x400000U     // CSM Passwords Read Status
#define DCSM_Z2_CR_FORCESEC   0x80000000U   // Force Secure

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABSECT1R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABSECT1R_GRAB_SECT0_S    0U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT0_M    0x3U          // Grab Flash Sector 0 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT1_S    2U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT1_M    0xCU          // Grab Flash Sector 1 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT2_S    4U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT2_M    0x30U         // Grab Flash Sector 2 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT3_S    6U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT3_M    0xC0U         // Grab Flash Sector 3 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT4_S    8U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT4_M    0x300U        // Grab Flash Sector 4 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT5_S    10U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT5_M    0xC00U        // Grab Flash Sector 5 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT6_S    12U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT6_M    0x3000U       // Grab Flash Sector 6 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT7_S    14U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT7_M    0xC000U       // Grab Flash Sector 7 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT8_S    16U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT8_M    0x30000U      // Grab Flash Sector 8 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT9_S    18U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT9_M    0xC0000U      // Grab Flash Sector 9 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT10_S   20U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT10_M   0x300000U     // Grab Flash Sector 10 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT11_S   22U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT11_M   0xC00000U     // Grab Flash Sector 11 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT12_S   24U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT12_M   0x3000000U    // Grab Flash Sector 12 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT13_S   26U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT13_M   0xC000000U    // Grab Flash Sector 13 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT14_S   28U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT14_M   0x30000000U   // Grab Flash Sector 14 in Bank 0
#define DCSM_Z2_GRABSECT1R_GRAB_SECT15_S   30U
#define DCSM_Z2_GRABSECT1R_GRAB_SECT15_M   0xC0000000U   // Grab Flash Sector 15 in Bank 0

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABSECT2R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABSECT2R_GRAB_SECT0_S    0U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT0_M    0x3U          // Grab Flash Sector 0 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT1_S    2U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT1_M    0xCU          // Grab Flash Sector 1 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT2_S    4U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT2_M    0x30U         // Grab Flash Sector 2 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT3_S    6U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT3_M    0xC0U         // Grab Flash Sector 3 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT4_S    8U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT4_M    0x300U        // Grab Flash Sector 4 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT5_S    10U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT5_M    0xC00U        // Grab Flash Sector 5 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT6_S    12U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT6_M    0x3000U       // Grab Flash Sector 6 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT7_S    14U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT7_M    0xC000U       // Grab Flash Sector 7 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT8_S    16U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT8_M    0x30000U      // Grab Flash Sector 8 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT9_S    18U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT9_M    0xC0000U      // Grab Flash Sector 9 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT10_S   20U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT10_M   0x300000U     // Grab Flash Sector 10 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT11_S   22U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT11_M   0xC00000U     // Grab Flash Sector 11 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT12_S   24U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT12_M   0x3000000U    // Grab Flash Sector 12 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT13_S   26U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT13_M   0xC000000U    // Grab Flash Sector 13 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT14_S   28U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT14_M   0x30000000U   // Grab Flash Sector 14 in Bank 1
#define DCSM_Z2_GRABSECT2R_GRAB_SECT15_S   30U
#define DCSM_Z2_GRABSECT2R_GRAB_SECT15_M   0xC0000000U   // Grab Flash Sector 15 in Bank 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABSECT3R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABSECT3R_GRAB_SECT0_S    0U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT0_M    0x3U          // Grab Flash Sector 0 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT1_S    2U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT1_M    0xCU          // Grab Flash Sector 1 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT2_S    4U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT2_M    0x30U         // Grab Flash Sector 2 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT3_S    6U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT3_M    0xC0U         // Grab Flash Sector 3 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT4_S    8U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT4_M    0x300U        // Grab Flash Sector 4 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT5_S    10U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT5_M    0xC00U        // Grab Flash Sector 5 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT6_S    12U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT6_M    0x3000U       // Grab Flash Sector 6 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT7_S    14U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT7_M    0xC000U       // Grab Flash Sector 7 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT8_S    16U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT8_M    0x30000U      // Grab Flash Sector 8 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT9_S    18U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT9_M    0xC0000U      // Grab Flash Sector 9 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT10_S   20U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT10_M   0x300000U     // Grab Flash Sector 10 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT11_S   22U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT11_M   0xC00000U     // Grab Flash Sector 11 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT12_S   24U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT12_M   0x3000000U    // Grab Flash Sector 12 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT13_S   26U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT13_M   0xC000000U    // Grab Flash Sector 13 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT14_S   28U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT14_M   0x30000000U   // Grab Flash Sector 14 in Bank 2
#define DCSM_Z2_GRABSECT3R_GRAB_SECT15_S   30U
#define DCSM_Z2_GRABSECT3R_GRAB_SECT15_M   0xC0000000U   // Grab Flash Sector 15 in Bank 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABRAM1R register
//
//*************************************************************************************************
#define DCSM_Z2_GRABRAM1R_GRAB_RAM0_S   0U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM0_M   0x3U      // Grab RAM LS0
#define DCSM_Z2_GRABRAM1R_GRAB_RAM1_S   2U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM1_M   0xCU      // Grab RAM LS1
#define DCSM_Z2_GRABRAM1R_GRAB_RAM2_S   4U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM2_M   0x30U     // Grab RAM LS2
#define DCSM_Z2_GRABRAM1R_GRAB_RAM3_S   6U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM3_M   0xC0U     // Grab RAM LS3
#define DCSM_Z2_GRABRAM1R_GRAB_RAM4_S   8U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM4_M   0x300U    // Grab RAM LS4
#define DCSM_Z2_GRABRAM1R_GRAB_RAM5_S   10U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM5_M   0xC00U    // Grab RAM LS5
#define DCSM_Z2_GRABRAM1R_GRAB_RAM6_S   12U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM6_M   0x3000U   // Grab RAM LS6
#define DCSM_Z2_GRABRAM1R_GRAB_RAM7_S   14U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM7_M   0xC000U   // Grab RAM LS7

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_EXEONLYSECT1R register
//
//*************************************************************************************************
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT0    0x1U          // Execute-Only Flash Sector 0
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT1    0x2U          // Execute-Only Flash Sector 1
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT2    0x4U          // Execute-Only Flash Sector 2
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT3    0x8U          // Execute-Only Flash Sector 3
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT4    0x10U         // Execute-Only Flash Sector 4
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT5    0x20U         // Execute-Only Flash Sector 5
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT6    0x40U         // Execute-Only Flash Sector 6
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT7    0x80U         // Execute-Only Flash Sector 7
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT8    0x100U        // Execute-Only Flash Sector 8
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT9    0x200U        // Execute-Only Flash Sector 9
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT10   0x400U        // Execute-Only Flash Sector 10
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT11   0x800U        // Execute-Only Flash Sector 11
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT12   0x1000U       // Execute-Only Flash Sector 12
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT13   0x2000U       // Execute-Only Flash Sector 13
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT14   0x4000U       // Execute-Only Flash Sector 14
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK0_SECT15   0x8000U       // Execute-Only Flash Sector 15
                                                                   // in flash Bank 0
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT0    0x10000U      // Execute-Only Flash Sector 0
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT1    0x20000U      // Execute-Only Flash Sector 1
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT2    0x40000U      // Execute-Only Flash Sector 2
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT3    0x80000U      // Execute-Only Flash Sector 3
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT4    0x100000U     // Execute-Only Flash Sector 4
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT5    0x200000U     // Execute-Only Flash Sector 5
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT6    0x400000U     // Execute-Only Flash Sector 6
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT7    0x800000U     // Execute-Only Flash Sector 7
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT8    0x1000000U    // Execute-Only Flash Sector 8
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT9    0x2000000U    // Execute-Only Flash Sector 9
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT10   0x4000000U    // Execute-Only Flash Sector 10
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT11   0x8000000U    // Execute-Only Flash Sector 11
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT12   0x10000000U   // Execute-Only Flash Sector 12
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT13   0x20000000U   // Execute-Only Flash Sector 13
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT14   0x40000000U   // Execute-Only Flash Sector 14
                                                                   // in flash Bank 1
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_BANK1_SECT15   0x80000000U   // Execute-Only Flash Sector 15
                                                                   // in flash Bank 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_EXEONLYSECT2R register
//
//*************************************************************************************************
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT0    0x1U      // Execute-Only Flash Sector 0 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT1    0x2U      // Execute-Only Flash Sector 1 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT2    0x4U      // Execute-Only Flash Sector 2 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT3    0x8U      // Execute-Only Flash Sector 3 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT4    0x10U     // Execute-Only Flash Sector 4 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT5    0x20U     // Execute-Only Flash Sector 5 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT6    0x40U     // Execute-Only Flash Sector 6 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT7    0x80U     // Execute-Only Flash Sector 7 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT8    0x100U    // Execute-Only Flash Sector 8 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT9    0x200U    // Execute-Only Flash Sector 9 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT10   0x400U    // Execute-Only Flash Sector 10 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT11   0x800U    // Execute-Only Flash Sector 11 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT12   0x1000U   // Execute-Only Flash Sector 12 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT13   0x2000U   // Execute-Only Flash Sector 13 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT14   0x4000U   // Execute-Only Flash Sector 14 in
                                                               // flash Bank 2
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_BANK2_SECT15   0x8000U   // Execute-Only Flash Sector 15 in
                                                               // flash Bank 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the Z2_EXEONLYRAM1R register
//
//*************************************************************************************************
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM0   0x1U    // Execute-Only RAM LS0
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM1   0x2U    // Execute-Only RAM LS1
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM2   0x4U    // Execute-Only RAM LS2
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM3   0x8U    // Execute-Only RAM LS3
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM4   0x10U   // Execute-Only RAM LS4
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM5   0x20U   // Execute-Only RAM LS5
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM6   0x40U   // Execute-Only RAM LS6
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM7   0x80U   // Execute-Only RAM LS7


//*************************************************************************************************
//
// The following are defines for the bit fields in the FLSEM register
//
//*************************************************************************************************
#define DCSM_FLSEM_SEM_S   0U
#define DCSM_FLSEM_SEM_M   0x3U      // Flash Semaphore Bit
#define DCSM_FLSEM_KEY_S   8U
#define DCSM_FLSEM_KEY_M   0xFF00U   // Semaphore Key

//*************************************************************************************************
//
// The following are defines for the bit fields in the SECTSTAT1 register
//
//*************************************************************************************************
#define DCSM_SECTSTAT1_STATUS_SECT0_S    0U
#define DCSM_SECTSTAT1_STATUS_SECT0_M    0x3U          // Zone Status flash Bank 0 Sector 0
#define DCSM_SECTSTAT1_STATUS_SECT1_S    2U
#define DCSM_SECTSTAT1_STATUS_SECT1_M    0xCU          // Zone Status flash Bank 0 sector 1
#define DCSM_SECTSTAT1_STATUS_SECT2_S    4U
#define DCSM_SECTSTAT1_STATUS_SECT2_M    0x30U         // Zone Status flash Bank 0 Sector 2
#define DCSM_SECTSTAT1_STATUS_SECT3_S    6U
#define DCSM_SECTSTAT1_STATUS_SECT3_M    0xC0U         // Zone Status flash Bank 0 Sector 3
#define DCSM_SECTSTAT1_STATUS_SECT4_S    8U
#define DCSM_SECTSTAT1_STATUS_SECT4_M    0x300U        // Zone Status flash Bank 0 Sector 4
#define DCSM_SECTSTAT1_STATUS_SECT5_S    10U
#define DCSM_SECTSTAT1_STATUS_SECT5_M    0xC00U        // Zone Status flash Bank 0 Sector 5
#define DCSM_SECTSTAT1_STATUS_SECT6_S    12U
#define DCSM_SECTSTAT1_STATUS_SECT6_M    0x3000U       // Zone Status flash Bank 0 Sector 6
#define DCSM_SECTSTAT1_STATUS_SECT7_S    14U
#define DCSM_SECTSTAT1_STATUS_SECT7_M    0xC000U       // Zone Status flash Bank 0 Sector 7
#define DCSM_SECTSTAT1_STATUS_SECT8_S    16U
#define DCSM_SECTSTAT1_STATUS_SECT8_M    0x30000U      // Zone Status flash Bank 0 sector 8
#define DCSM_SECTSTAT1_STATUS_SECT9_S    18U
#define DCSM_SECTSTAT1_STATUS_SECT9_M    0xC0000U      // Zone Status flash Bank 0 Sector 9
#define DCSM_SECTSTAT1_STATUS_SECT10_S   20U
#define DCSM_SECTSTAT1_STATUS_SECT10_M   0x300000U     // Zone Status flash Bank 0 Sector 10
#define DCSM_SECTSTAT1_STATUS_SECT11_S   22U
#define DCSM_SECTSTAT1_STATUS_SECT11_M   0xC00000U     // Zone Status flash Bank 0 Sector 11
#define DCSM_SECTSTAT1_STATUS_SECT12_S   24U
#define DCSM_SECTSTAT1_STATUS_SECT12_M   0x3000000U    // Zone Status flash Bank 0 Sector 12
#define DCSM_SECTSTAT1_STATUS_SECT13_S   26U
#define DCSM_SECTSTAT1_STATUS_SECT13_M   0xC000000U    // Zone Status flash Bank 0 Sector 13
#define DCSM_SECTSTAT1_STATUS_SECT14_S   28U
#define DCSM_SECTSTAT1_STATUS_SECT14_M   0x30000000U   // Zone Status flash Bank 0 Sector 14
#define DCSM_SECTSTAT1_STATUS_SECT15_S   30U
#define DCSM_SECTSTAT1_STATUS_SECT15_M   0xC0000000U   // Zone Status flash Bank 0 Sector 15

